/* Оператор логічної умови */
/* If - Якщо (если) */
/*
if (логічна операція, результатом якої буде тип даних Boolean) {
    блок коду
}
Блок коду виконується тільки тоді, коли логічна операція = true
*/

if (2+2===5) {
    console.log(true);
    if (1 + 1 === 2) {
        console.log(true);
    }
    console.log('test');
}

/* if-else */
/* else - інакше (в противном случае) */

/*
if (логічна умова) {
    блок коду, який виконається, якщо умова = true
} else {
    блок коду, який виконається, якщо умова = false
}
*/

if (2 + 2 === 8) {
    console.log(true);
} else {
    console.log(false);
}


/* Задача 1

1. Створити змінні
a = 3;
b = 6;
n = 8;

2. Якщо b - парне, тоді n збільшити на 5, у іншому випадку a зробити = 15
3. Вивести змінні на консоль.

*/

let a = 3;
let b = 6;
let n = 8;

if (b % 2 === 0) {
    n += 5; // n = n + 5
} else {
    a = 15;
}

console.log(a, b, n);

/* if - else if - else */

/*
if (умова 1) {
    блок коду, який виконається, якщо умова1 = true
} else if (умова 2) {
    блок коду, який виконається, якщо умова2 = true
} else {
    блок коду, який виконається, якщо умова1 і умова2 = false
}
*/

/* Задача 3

1. Маємо змінну min = 20

2. 
Якщо min попадає в першу чверть години - вивести на консоль "перша чверть"
Якщо min попадає в другу чверть години - вивести на консоль "друга чверть"
Якщо min попадає в третю чверть години - вивести на консоль "третя чверть"
Якщо min попадає в четверу чверть години - вивести на консоль "четверта чверть"
*/

let min = 45;

if (min >= 0 && min <= 15) {
    console.log('первая четверть');
} else if (min > 15 && min <= 30) {
    console.log('вторая четверть');
} else if (min > 30 && min <= 45) {
    console.log('третья четверть');
} else if(min > 45 && min <= 60) {
    console.log('четвертая четверть');
} else if(min < 0 || min > 60 || typeof min !== 'number') {
    console.log('произошла ошибка!');
}

/* Задача 4

Потрібно визначити, чи цей рік є високосним.

Умови високосності року.
1. Якщо його номер кратний 4.
2. Не кратний 100.
АБО
Кратний 400.
*/

const year = 1948;
if(year % 4 === 0 && year % 100 !== 0 || year % 400 === 0) {
    console.log(year + ' є високосним');
} else {
    console.log('Рік не є високосним');
}

/* Задача 5

Козак Вус проводить змагання з програмування, в якому беруть участь n людей.
Він вирішив нагородити їх усіх ручками та блокнотами.
Відомо, що Ус має рівно m ручок і k блокнотів.
Визначте, чи може Козак нагородити учасників, даючи кожному з них щонайменше по одній ручці та як мінімум по одному блокноту.
*/

let n_ = 45; // количество участников
let m = 50; // количество ручек
let k = 50; // количество блокнотов
if (m >= n_ && k >= n_) {
    console.log('Так, зможе нагородити!');
}
 else {
    console.log('Ні, не зможе нагородити!');
 }