// filter

const array = [5, 3, -9, 21, -5, 1, -2, 4];

// Створити новий масив, в який попадуть тільки ті елемнети зі старого масиву, які більше за 0

function filterFunc(item) {
    // if(item > 0) {
    //     return true;
    // } else {
    //     return false;
    // }
    return item > 0;
}

/*
Функція приймає 1 аргумент - кожен елемент початкового масиву
Функція повертає true, якщо елемент підходить (пройшов перевірку) і і має увійти в новий масив
false - якщо елемент не підходить
*/

const filteredArray = array.filter(filterFunc);

/* 
Створити новий масив, в який увійдуть тільки парні елементи початкового масива
*/
// return item % 2 === 0;