/* Логічні оператори */

// Boolean

const a = true;
!a // false
// ! - заперечення (отрицание)
!!a // true 
// !! - подвійне заперечення, використовується для приведення значення до типу даних Boolean
let b = 'sdgsdgdsf';
console.log(!!b)

Boolean(); // явне приведення типу до Boolean

4 > 5; // false
7 < 9; // true
console.log(7 < 9);

//------- Порівняння рядків
const res10 = 'a' > 'A'; // true, тому що в 'a' код 61, а в 'A' - 41.
const res11 = 'b' < 'c'; // true

// == - приводить операнди до одного типу даних, і потім порівнює. НЕ РЕКОМЕНДУЄТЬСЯ
const res12 = 5 == 6; // false
const res13 = 6 == 6; // true

// === - порівнює операнди і за значенням, і за типом даних. РЕКОМЕНДУЄТЬСЯ
const res5 = 5 === '5'; // false
const res6 = 5 === 5; // true

/* Більше-або-дорівнює і менше-або-дорівнює */
3 >= 3; // true
3 >= 2; // true

5 <= 6; // true
4 <= 4; // true

const res7 = 5 !== 5; // false
console.log(res7)