/* % - залишок від цілочисельного поділу */

let div = 5 / 3; // 1,666666666(6)
let rest = 5 % 3; // 2

let pair = 4 % 2; // 0
let unPair = 5 % 2; // 1


//-----------------------------------------

const x3 = 3**3; // Оператор ступеня (степени)

//------------------ Increment, decrement

let i = 1;
i++; // 2
i--; // 1

// Prefix
++i; // Інкремент буде виконано першим ділом, потім всі інші операції
--i; // Декремент буде виконано першим ділом, потім всі інші операції

// Postfix
i++; // Спочатку буде використано значення змінної, а після завершення операції вона інкрементується
i--; // Спочатку буде використано значення змінної, а після завершення операції вона декрементується

let j = 0;
console.log(j++);

//////////////////////////////

let k = 0;
k = k + 2; // 2
k = k - 1; // 1

k += 2; // k = k + 2;
k -= 3; // k = k - 3;
k *= 4; // k = k * 4;
k /= 5; // k = k / 5;

/* Унарні оператори */
let o = 1;
o = -o;
console.log(o);

/* явне завжди краще за неявне */