/*
Вивести на консоль таблицю множенння від 1 до 5 у вигляді:
1х1 = 1
1х2 = 2
......
2х1=2
2х2=4
....
5х1=5
5х2=10
5х3
5х4
5х5
5х6
5х7
5х8
5х9
5х10

*/
    // for(let i=1; i <= 5; i++) { // 1
    //     for(let j=1; j <= 10; j++) { // 1..2..3..4..5
    //         console.log(`${i} x ${j} = ${i*j}`);
    //     }
    // }

    // товари = [[...побутова_техніка...], [...садова_техніка...], [...алкоголь...]]


const number = [[1,2,3],[4,5,6],[7,8,9]];    


function sumArray(array) {
    let sum = 0;

    for(let i = 0; i < array.length; i++) { // number
        for(let j = 0; j < array[i].length; j++) { // number => item
            sum += array[i][j];
        }
    }

    return sum;
}

console.log(sumArray(number));

// Домашнє завдання
/*
Дано подвійний масив чисел:
const number = [[1,2,3],[4,5,6],[7,8,9]];

Завдання.
Мова про вкладені у масив цикли.

Якщо у парному масиві число парне - замінити елемент масиву рядком 'pp'.
Якщо у парному масиві число непарне - замінити елемент масиву рядом 'pn'.
Якщо у непарному масиві число парне - замінити елемент масиву рядком 'np'.
Якщо у непарному масиві число непарне - замінити елемент масиву рядком 'nn'.
*/