const number = [[1,2,3],[4,5,6],[7,8,9]];    


// Домашнє завдання
/*
Дано подвійний масив чисел:
const number = [[1,2,3],[4,5,6],[7,8,9]];

Завдання.
Мова про вкладені у масив цикли.

Якщо у парному масиві число стоїть на парному індексі – замінити елемент масиву рядком 'pp'.
Якщо у парному масиві число стоїть на непарному індексі – замінити елемент масиву рядком – 'pn'.
Якщо у непарному масиві число стоїть на парному індексі – замінити елемент масиву рядком – 'np'.
Якщо у непарному масиві число стоїть на непарному індексі – замінити елемент масиву рядком – 'nn'.
*/

function testArray(array) {
    for(let i = 0; i < array.length; i++) {
        for(let j = 0; j < array[i].length; j++) {
            if(i % 2 === 0 && j % 2 === 0) {
                array[i][j] = 'pp';
            }
            if(i % 2 === 0 && j % 2 !== 0) {
                array[i][j] = 'pn';
            }
            if(i % 2 === 1 && j % 2 === 0) {
                array[i][j] = 'np';
            }
            if(i % 2 === 1 && j % 2 !== 0) {
                array[i][j] = 'nn';
            }
        }
    }
    
    return array;
}

console.log(testArray(number));
