/*
if (умова) {
    оператори...
    блок коду, який буде виконуватись, якщо умова = true
} else {
    оператори....
    блок коду, який буде виконуватись, якщо умова = false
}
*/

/* тернарний оператор

let result = умова ? операнд1 : операнд2

*/

/*
Маркетплейс знаходиться у Шотландії.
Серед товарів є алкоголь та тютюнові вироби.
Реалізувати обмеження: алкоголь та тютюнові вироби продаються тільки повнолітнім.
*/

const age = 14;
let isAdult = age < 16 ? 'not adult' : 'adult';
console.log(isAdult);

/*
(булева змінна login - true/false)
Створіть змінну viewMode, яка у випадку авторизованного користувача має містити рядок 'authMode',
а у випадку неавторизованого - 'unauth'
*/

let login = false;
let viewMode = login ? 'authMode' : 'unAuth';
console.log(viewMode);

/*
Якщо число входить в діапазон від 6 до 12, то у змінній результат має міститись рядок 'in'.
В протилежному випадку - рядок 'out'.
Підказка: &&
*/

let number = 29;
let result = (number >= 6 && number <= 12) ? 'in' : 'out';
console.log(result);